Public Member Functions | List of all members
ACAPI::MEP::Adapter::UniqueID Class Reference
MEP Element Manager
It is a helper class that converts a simple GS::Guid or API_Guid into an MEP::UniqueID. More...
#include <MEPAdapter.hpp>
 Inheritance diagram for ACAPI::MEP::Adapter::UniqueID:
 Public Member Functions
UniqueID (const GS::Guid &guid)
UniqueID (const API_Guid &guid)
 Public Member Functions inherited from ACAPI::MEP::UniqueID
UniqueID (const GS::Guid &, const API_Token &)
Detailed Description
It is a helper class that converts a simple GS::Guid or API_Guid into an MEP::UniqueID.